/***********************************************************************************
* Заголовочный файл для	: Модуля связи по шине RS-485
*
************************************************************************************/

#ifndef __RS485_H
#define __RS485_H

//--- INCLUDES -------------------

#include "GPIO_STM32F10x.h"
#include "stm32f10x.h"
#include "Board.h"

// --- DEFINES -------------------
#define DELAY_BEFORE_SEND	1	// задержка отправки после переключения в режим передачи
#define DELAY_AFTER_SEND	2	// задержка переключения в режим приема после передачи

// --- TYPES ---------------------

//--- FUNCTIONS ------------------

void Rs485_Init(void);
void RS485_SendBuf( const char * pBuf, uint8_t count );

#endif
